Revit 2024 API
FabricSheet.IsValidHost Method (Element)
 Checks whether an element is a valid host for fabric sheet.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static bool IsValidHost(
	Element host
)
Visual Basic
Public Shared Function IsValidHost ( _
	host As Element _
) As Boolean
Visual C++
public:
static bool IsValidHost(
	Element^ host
)
Parameters
host
Type: Autodesk.Revit.DB.Element
 The element to check.
Return Value
 True if the element is a valid host for fabric sheet, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FabricSheet Class
IsValidHost Overload
Autodesk.Revit.DB.Structure Namespace